benchmarks/OpenFOAM/2D/standingCapillaryWave/Cases/mycCartesian/mlpCurvature/coarsest/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object fvSolution;
}

solvers
{
  alpha.water
  {
    advectionScheme isoAdvection;
    reconstructionScheme mycCartesian; 	//advectionScheme isoAdvection;//reconstructionScheme mycCartesian; //youngCartesian; //plicRDF; // isoAlpha; // isoAlpha//vof2IsoTol 1e-8;//surfCellTol 1e-8;
    writeVTK no;
    isoFaceTol 1e-10;
    surfCellTol 1e-08;
    nAlphaBounds 3;
    snapTol 1e-12;
    clip yes;
    nAlphaSubCycles 1;
    nAlphaCorr 1;
    cAlpha 1;
    writeIsoFaces no;
  }
  "pcorr.*"
  {
    solver PCG;
    preconditioner DIC;
    tolerance 1e-10;
    relTol 0;
  }
  p_rgh
  {
    solver GAMG;
    tolerance 1e-09;
    relTol 0.001;
    smoother DIC;
  }
  p_rghFinal
  {
    solver PCG;
    preconditioner
    {
      preconditioner GAMG;
      tolerance 1e-07;
      relTol 0;
      nVcycles 2;
      smoother DICGaussSeidel;
      nPreSweeps 2;
    }
    tolerance 1e-12;
    relTol 0;
    maxIter 100;
  }
  U
  {
    solver PBiCGStab;
    preconditioner DILU;
    tolerance 1e-20;
    relTol 0;
    minIter 5;
  }
  UFinal
  {
    solver PBiCGStab;
    preconditioner DILU;
    tolerance 1e-10;
    relTol 0;
    minIter 5;
  }
}

PIMPLE
{
  momentumPredictor yes;
  nCorrectors 4;
  nNonOrthogonalCorrectors 0;
  correctPhi no;
  pRefPoint (1e-05 0 -0.003);
  pRefValue 0;
} 	// ************************************************************************* //

